IISSPTestApplication/bin/Debug/output.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <msg:Envelope xmlns:msg="urn:cz:mfcr:iissp:schemas:Messaging:v1">
      <msg:EnvelopeHeader>
        <cmn:TransactionId xmlns:cmn="urn:cz:mfcr:iissp:schemas:Common:v1">00000000000000026955</cmn:TransactionId>
        <msg:DateTimeCreated>2012-12-05T19:28:41+01:00</msg:DateTimeCreated>
        <msg:Sender>
          <cmn:IC xmlns:cmn="urn:cz:mfcr:iissp:schemas:Common:v1">00006947</cmn:IC>
          <cmn:SubjectName xmlns:cmn="urn:cz:mfcr:iissp:schemas:Common:v1">Ministerstvo financí</cmn:SubjectName>
          <cmn:Module xmlns:cmn="urn:cz:mfcr:iissp:schemas:Common:v1">RISRE</cmn:Module>
          <cmn:ResponsiblePerson xmlns:cmn="urn:cz:mfcr:iissp:schemas:Common:v1">
            <cmn:PersonName>Kompetenční centrum</cmn:PersonName>
            <cmn:PersonId>KC</cmn:PersonId>
          </cmn:ResponsiblePerson>
        </msg:Sender>
        <msg:Recipient>
          <cmn:IC xmlns:cmn="urn:cz:mfcr:iissp:schemas:Common:v1">00164801</cmn:IC>
          <cmn:SubjectName xmlns:cmn="urn:cz:mfcr:iissp:schemas:Common:v1">IN-SY-CO</cmn:SubjectName>
          <cmn:ResponsiblePerson xmlns:cmn="urn:cz:mfcr:iissp:schemas:Common:v1">
            <cmn:PersonName>Tibor Stuchlik</cmn:PersonName>
            <cmn:Email>tibor@stuchlik.info</cmn:Email>
            <cmn:PersonId>EU8598098824</cmn:PersonId>
          </cmn:ResponsiblePerson>
        </msg:Recipient>
      </msg:EnvelopeHeader>
      <msg:EnvelopeBody>
        <risre:ZpravaRisre xmlns:risre="urn:cz:mfcr:iissp:schemas:Risre:v1">
          <risre:ZpracovaniChyba>
            <risre:TypMaximum>E</risre:TypMaximum>
            <risre:Polozka>
              <risre:Typ>I</risre:Typ>
              <risre:ID>ZZPIMAIN|002</risre:ID>
              <risre:Text>Kontrola formátu a syntaxe zprávy proběhla úspěšně.</risre:Text>
            </risre:Polozka>
            <risre:Polozka>
              <risre:Typ>I</risre:Typ>
              <risre:ID>ZZPIMAIN|004</risre:ID>
              <risre:Text>Kontrola oprávněné osoby proběhla úspěšně.</risre:Text>
            </risre:Polozka>
            <risre:Polozka>
              <risre:Typ>E</risre:Typ>
              <risre:ID>ZZPIMAIN|007</risre:ID>
              <risre:Text>Kontrola elektronického podpisu zprávy skončila neúspěšně.</risre:Text>
            </risre:Polozka>
            <risre:Polozka>
              <risre:Typ>E</risre:Typ>
              <risre:ID>ZZPITECH|020</risre:ID>
              <risre:Text>Certifikátu obsaženém v digitálním podpisu skončila platnost.</risre:Text>
            </risre:Polozka>
            <risre:Polozka>
              <risre:Typ>I</risre:Typ>
              <risre:ID>ZZPITECH|030</risre:ID>
              <risre:Text>Certifikát obsažený v digitálním podpisu nebyl validován.</risre:Text>
            </risre:Polozka>
          </risre:ZpracovaniChyba>
        </risre:ZpravaRisre>
      </msg:EnvelopeBody>
    </msg:Envelope>
  </soapenv:Body>
</soapenv:Envelope>